import type { Program } from '@/models/Program'

export const programs: Program[] = [
  {
    id: 1,
    name: 'Пятница — 22.11.2025',
    songs: [
      {
        id: 1,
        order: 1,
        song: {
          id: 1,
          name: 'Будем петь',
          key: 'E',
          bpm: 120,
          structure: [
            { text: 'и', amount: 1 },
            { text: 'п', amount: 2 },
            { text: 'к', amount: 2 },
            { text: 'п', amount: 1 },
            { text: 'п', amount: 1 },
            { text: 'к2', amount: 1 },
            { text: 'прг', amount: 2 },
          ],
          text: `Припев:  
               E 
Будем петь, петь, петь с благодарными сердцами 
            C#m 
Будем петь, петь, петь вместе с небесами 
             H                         A                E 
Воспевать хвалу и славить Иисуса! 

Куплет:  
E 
Великий и Прекрасный народы все и царства 
C#m 
Перед Тобой склонятся, Божий Сын 
                          H                            A                        E 
Лишь для Тебя, лишь для Тебя вся жизнь моя 
E 
Ты нас освобождаешь с любовью направляешь 
C#m 
Огонь в нас зажигаешь, Божий Сын! 
                          H                            A                        E 
Лишь для Тебя, лишь для Тебя вся жизнь моя
`,
        },
      },
      {
        id: 2,
        order: 2,
        song: {
          id: 2,
          name: 'Ты ждешь когда я приду',
          key: 'C#m',
          bpm: 140,
          structure: [
            { text: 'и', amount: 1 },
            { text: 'к', amount: 1 },
            { text: 'п', amount: 2 },
            { text: 'к2', amount: 1 },
            { text: 'п-п', amount: 1 },
            { text: 'п', amount: 1 },
            { text: 'прг', amount: 1 },
          ],
          text: `Припев:  
C#m                                     A             E               F#m
Ты ждешь когда я приду к Тебе такой как есть
C#m                                     A             E               F#m
Ты ждешь когда я приду к Тебе такой как есть

Куплет:  
C#m                            A                         E        F#m
Печать Твоей любви в сердце моем навеки, навсегда
C#m           A                   E     F#m 
Как велика Твоя любовь ревность как летящая стрела
C#m              A         E                        F#m
Ничто не в силах угасить Твою любовь

Бридж 1:  
C#m            A                         E                              F#m 
Приди огнем Своим Господь сожги мой грех, омой меня
C#m           A                           E                         F#m
Приди огнем Своим Господь и будем вместе Ты и я

Бридж 2:  
C#m                                  A  
Больше не хочу говорить я и в ночной темноте
E                                      F#m  
Лишь смотреть на Тебя хочу только петь Тебе`,
        },
      },
      {
        id: 3,
        order: 3,
        song: {
          id: 3,
          name: 'Дом Отца',
          key: 'H',
          bpm: 140,
          structure: [
            { text: 'и', amount: 1 },
            { text: 'к', amount: 2 },
            { text: 'п-п', amount: 1 },
            { text: 'к2', amount: 1 },
            { text: 'п', amount: 1 },
            { text: 'к2', amount: 1 },
            { text: 'п', amount: 4 },
            { text: 'к2', amount: 1 },
            { text: 'п', amount: 1 },
            { text: 'к2', amount: 1 },
            { text: 'п', amount: 1 },
            { text: 'прг', amount: 2 },
            { text: 'б', amount: 2 },
            { text: 'б2', amount: 2 },
          ],
          text: `Интро:   
G#m F# H/D# E

Куплет:  
    G#m          F#    E              H                          
В жизни так бывает, вдруг все идет не так.
        G#m               F#                     E                     H                         
Но силу Ты являешь там, где я бываю слаб
       G#m                   F#          E                H                                    
Подводить итоги рано, ведь это не конец.
    G#m                F#                 E                   H                                                 
Я не побежденный, Победитель - мой Отец.
    G#m                F#                 E                   H                          
Да я не побежденный, Победитель мой Отец.

Припев:  
   G#m   F#                       E          H
Уу,                 груз сними с себя
     G#m   F#                             E        H
Уу,                пришёл ты в дом Отца
                   G#m          F#        
Стыд оставь у дверей
                        E               H
Ему здесь места больше нет
     G#m   F#                          E       H
Уу,                      ты в доме у Отца

Проигрыш:  
G#m F# H/D# E

Куплет 2:  
Значение имеет не только цель, но путь.
Не ждешь ты совершенства, но смотришь в сердце суть.
Историю венчает не начало, а конец.
Не вечно поражение, когда рядом Бог Отец!
Не вечно поражение, когда рядом Бог Отец!

Бридж:  
H                                   E/H         H                                                                                
Блудные сыны вновь дом обрели,
E/H                         H                E/H                H
Любовь меняет все, с нами наш Отец и Бог!
H                                              E/H                 H
Свободен узник вновь, жив тот, кто был мертв
      E/H                   H                E/H                 H     
Любовь меняет все, с нами наш Отец и Бог!
H                                   E                 H/F#
Божьи чудеса открывают сердца.
E/G#                 H/F#                E                  H                                       
Царствует любовь, с нами наш Отец и Бог!
H/D#                                              E                 H/F#
Преграды содрогнулись, твердыни пошатнулись.
E/G#               H/F#                E                   H                                                             
Царствует любовь, с нами наш Отец и Бог!
E/G#               H/F#                E                   H                                                             
Вновь царствует любовь, с нами наш Отец и Бог!
`,
        },
      },
      {
        id: 4,
        order: 4,
        song: {
          id: 4,
          name: 'Жить в твоей реальности',
          key: 'E',
          bpm: 140,
          structure: [
            { text: 'и', amount: 1 },
            { text: 'к', amount: 2 },
            { text: 'п-п', amount: 1 },
            { text: 'к2', amount: 1 },
            { text: 'п', amount: 1 },
            { text: 'к2', amount: 1 },
            { text: 'п', amount: 4 },
            { text: 'к2', amount: 1 },
            { text: 'п', amount: 1 },
          ],
          text: `Интро:   
Em Hm C D

Куплет:  
Em                       Hm
Жить в Твоей реальности
   C                            D
Жить на Твоей высоте
      Em                            Hm
С Тобою двигаться в радости
   C                            D
Так сильно хочется мне

Пред-припев:   
Em                 Hm
Мои слова пусть возносят лишь Тебя
C                         D
От всяких оков Бог освободил меня
Em                  Hm
Ты как поток, оживляющий меня
C     D
О-о-о

Припев:   
Em                        Hm
Знать Тебя, Творец, желаю
  C                               D
Больше с каждым днём
  Em                     Hm
Пусть потоки Твоей силы
 C                    D
Заполняют всё

Проигрыш:   
Em Hm C D

Бридж: х2  
Am                    Em     D
Да, Твои Небеса здесь
Am               Em     D
Да, Сила Твоя в нас
Am                    Em     D
Да, Твои Небеса здесь
Am               Em     D
Да, Сила Твоя в нас`,
        },
      },
    ],
  },
  {
    id: 2,
    name: 'Воскрсенье — 16.01.2026',
    songs: [],
  },
]
